## Pandas

## DataFrame
1. 판다스의 2차원 자료 구조 객체(Matrix)
 - 데이터프레임(컬럼, 데이터, 인덱스)
2. ndarray, dict, list 등 다양한 데이터 타입으로부터 pandas의 DataFrame 생성

In [20]:
import pandas as pd
import numpy as np

In [2]:
dict_data = {'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12], 'c4': [13,14,15]}
df = pd.DataFrame(dict_data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [13]:
# 데이터와 행인덱스, 열 이름을 지정해서 DataFrame 생성
df2 = pd.DataFrame([[25,'남' , '율도국'],[17, '여', '인당수']], index=['홍길동', '심청'], columns=['나이', '성별', '주소'])

In [14]:
print(type(df2))
print(df2)
print(df2.index)
print(df2.columns)
print(id(df2))

<class 'pandas.core.frame.DataFrame'>
     나이 성별   주소
홍길동  25  남  율도국
심청   17  여  인당수
Index(['홍길동', '심청'], dtype='object')
Index(['나이', '성별', '주소'], dtype='object')
2047088462792

In [15]:
df2.index = ['주인공1','주인공2'] #행 변경
df2

      나이 성별   주소
주인공1  25  남  율도국
주인공2  17  여  인당수

In [16]:
df2.columns = ['age','gender','address'] #열 변경

In [17]:
df2

      age gender address
주인공1   25      남     율도국
주인공2   17      여     인당수

In [18]:
print(id(df2))

2047088462792

In [24]:
# IPython.display은 IPython 셸 환경에서 dataframe을 테이블 형식으로 표현합니다.
from IPython.display import display
my_2darray = np.array([[1,2,3], [4,5,6]])
display(pd.DataFrame(my_2darray))
display(df2)

   0  1  2
0  1  2  3
1  4  5  6

      age gender address
주인공1   25      남     율도국
주인공2   17      여     인당수

In [35]:
exam_data= {'수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data, index=['영희', '철수', '삼식'])
print(df)
print(id(df))

    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70
2047122734344

In [34]:
#행삭제
df2 = df[:]  # 새로운 DataFrame 객체를 복제
print(id(df2))
result = df2.drop('삼식') # 행 인덱스(label)로 행 삭제한 새로운 데이터프레임 객체 생성 반환
print(df2)
print(id(df2))
print(df)
df2.drop('삼식', inplace=True) #행 삭제한 새로운 데이터프레임 객체 반환대신 자기자신의 행 삭제
print(df2)

    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70
2047090024520
    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70
    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70

In [37]:
#열삭제
df2 = df[ : ]  # 새로운 DataFrame객체를 복제함
print(id(df2))
df2.drop('수학', axis=1,  inplace=True) 
print(df2)

2047122709000
    영어   국어  과학
영희  95  100  70
철수  89   80  70
삼식  90   75  70

In [38]:
student1 = df.loc['철수']   #label 을 사용해서 행을 선택 - 라벨 인덱스라고 함
print(student1)
student2 = df.iloc[0]  #index 을 사용해서 행을 선택 - 인덱스라고 함
print(student2)

수학    80
영어    89
국어    80
과학    70
Name: 철수, dtype: int64
수학     90
영어     95
국어    100
과학     70
Name: 영희, dtype: int64

In [53]:
exam_data= {'수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data, index=['영희', '철수', '삼식'])

students1 = df.loc[['철수','삼식']]   #label 을 사용해서 2개 이상 행을 선택
print(students1)
print()
students2 = df.iloc[[0,1]]  #index 을 사용해서 2개 이상 행을 선택
print(students2)
print()

students3 = df.loc['영희':'삼식']   #label 을 사용해서 2개 이상 행을 선택
print(students3)
print()
students4 = df.iloc[0:2]  #index 을 사용해서 2개 이상 행을 선택
print(students4)
print()

    수학  영어  국어  과학
철수  80  89  80  70
삼식  70  90  75  70

    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70

    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70

    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70

In [54]:
exam_data= {'이름' : ['영희', '철수', '삼식'],
                  '수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   국어  과학
0  영희  90  95  100  70
1  철수  80  89   80  70
2  삼식  70  90   75  70

In [56]:
print(df['수학'])
print(df.수학)

0    90
1    80
2    70
Name: 수학, dtype: int64
0    90
1    80
2    70
Name: 수학, dtype: int64

In [58]:
eng = df.영어
print(eng)
print(type(eng)) #Series

0    95
1    89
2    90
Name: 영어, dtype: int64
<class 'pandas.core.series.Series'>

In [64]:
sub = df[['수학','국어']]
print(sub)
print(type(sub)) #DataFrame

   수학   국어
0  90  100
1  80   80
2  70   75
<class 'pandas.core.frame.DataFrame'>

In [65]:
print(df)
df.set_index('이름',inplace = True) #인덱스를 컬럼'이름'으로 지정함
print(df)

   이름  수학  영어   국어  과학
0  영희  90  95  100  70
1  철수  80  89   80  70
2  삼식  70  90   75  70
    수학  영어   국어  과학
이름
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70

In [71]:
#철수의 수학,과학 점수 선택 출력
print(df.loc['철수', ['수학','과학']])
print(df.iloc[1, [0,3]])

수학    80
과학    70
Name: 철수, dtype: int64
수학    80
과학    70
Name: 철수, dtype: int64

In [73]:
# 철수의 수학, 과학 점수 선택 출력 (label인덱스와 index 사용합니다.)
a = df.loc[ '철수', ['수학', '과학' ]]
print(a)

b = df.iloc[ 1, [0, 3 ]]
print(b)

# 철수의 국어, 과학 점수 선택 출력
a = df.loc[ '철수',  '국어':'과학']
print(a)

b = df.iloc[ 1, 2: ]
print(b)

수학    80
과학    70
Name: 철수, dtype: int64
수학    80
과학    70
Name: 철수, dtype: int64
국어    80
과학    70
Name: 철수, dtype: int64
국어    80
과학    70
Name: 철수, dtype: int64

In [78]:
exam_data= {'이름' : ['영희', '철수', '삼식'],
                  '수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data)
print(df)
#컬럼의 데이터 단일값으로 일괄 변경, 과학컬럼에 데이터 추가
df['과학']= 95
print(df) # 과학점수가 95로 추가됨
df.loc[3] = 0
print(df)

#서로다르게 추가하려면 일일이 넣어줘야 함
df.loc[4] = ['동식', 70, 80, 90, 100]
print(df)

#기존 행 복사
df.loc[5] = df.loc[3]
print(df)

   이름  수학  영어   국어  과학
0  영희  90  95  100  70
1  철수  80  89   80  70
2  삼식  70  90   75  70
   이름  수학  영어   국어  과학
0  영희  90  95  100  95
1  철수  80  89   80  95
2  삼식  70  90   75  95
   이름  수학  영어   국어  과학
0  영희  90  95  100  95
1  철수  80  89   80  95
2  삼식  70  90   75  95
3   0   0   0    0   0
   이름  수학  영어   국어   과학
0  영희  90  95  100   95
1  철수  80  89   80   95
2  삼식  70  90   75   95
3   0   0   0    0    0
4  동식  70  80   90  100
   이름  수학  영어   국어   과학
0  영희  90  95  100   95
1  철수  80  89   80   95
2  삼식  70  90   75   95
3   0   0   0    0    0
4  동식  70  80   90  100
5   0   0   0    0    0

In [81]:
#철수의 수학,과학 점수 50으로 변경
df.set_index('이름', inplace=True)
df.loc['철수', ['수학','과학']] = 50,50,
df

    수학  영어   국어   과학
이름
영희  90  95  100   95
철수  50  89   80   50
삼식  70  90   75   95
0    0   0    0    0
동식  70  80   90  100
0    0   0    0    0

In [85]:
#데이터 프레임에서 전치를 수행하려면 메소드 활용, df.transpose()
print(df)
df = df.transpose()
print(df)

df = df.T #데이터 프레임 클래스의 속성활용
print(df)

이름   영희  철수  삼식  0   동식  0
수학   90  50  70  0   70  0
영어   95  89  90  0   80  0
국어  100  80  75  0   90  0
과학   95  50  95  0  100  0
    수학  영어   국어   과학
이름
영희  90  95  100   95
철수  50  89   80   50
삼식  70  90   75   95
0    0   0    0    0
동식  70  80   90  100
0    0   0    0    0
이름   영희  철수  삼식  0   동식  0
수학   90  50  70  0   70  0
영어   95  89  90  0   80  0
국어  100  80  75  0   90  0
과학   95  50  95  0  100  0

In [99]:
#인데스 재 지정할 때, reindex()
dict_data = {'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12], 'c4': [13,14,15]}
df2 = pd.DataFrame(dict_data, index=['r0','r1','r2'])
print(df2)

new_index = ['r0','r1','r2','r3','r4']
new_df = df2.reindex(new_index) #새로운 데이터프레임 객체를 생성 반환
print(new_df) #'r3','r4' 행의 데이터는 NaN으로 채워짐

new_df2 = df2.reindex(new_index, fill_value=0) #새로운 데이터프레임 객체를 생성 반환, fill_value를 통해 Na를 0으로 채움
print(new_df2) #'r3','r4' 행의 데이터는 0으로 채워짐

# 행 인덱스를 정수형으로 초기화 시킴, reset_index()
new_df = df2.reset_index()
print(new_df)

# 행 인덱스 기준으로 정렬, sort_index(ascending=False) 
new_df = df2.sort_index(ascending=False)
print(new_df)

# 새로운 데이터프레임 객체를 생성 반환 , 행 인덱스기준으로 내림차순 정렬, 
new_df = df2.sort_values(by='c2', ascending=False )  
print(new_df )

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN
    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0
  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15
    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13
    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [102]:
#시리즈는 라벨인덱스가 일치한 애들끼리 연산을 수행함

student1 = pd.Series({'국어':100, '영어':90, '수학':80})
percentage = student1/300 #벡터라이징 연산을 수행
print(percentage)
print(type(percentage))

student1 = pd.Series({'국어':np.nan, '영어':90, '수학':80})
student2 = pd.Series({'영어':90, '수학':80})
print(student1)
print(student2)
print(student1 + student2) #student1.add(student2, fill_value = 0)
print(student1 - student2) #student1.sub(student2, fill_value = 0)
print(student1 * student2) #student1.mul(student2, fill_value = 0)
print(student1 / student2) #student1.div(student2, fill_value = 0)

국어    0.333333
영어    0.300000
수학    0.266667
dtype: float64
<class 'pandas.core.series.Series'>
국어     NaN
영어    90.0
수학    80.0
dtype: float64
영어    90
수학    80
dtype: int64
국어      NaN
수학    160.0
영어    180.0
dtype: float64
국어    NaN
수학    0.0
영어    0.0
dtype: float64
국어       NaN
수학    6400.0
영어    8100.0
dtype: float64
국어    NaN
수학    1.0
영어    1.0
dtype: float64

In [105]:
re_add = student1.add(student2, fill_value=0)
re_sub = student1.sub(student2, fill_value=0)
re_mul = student1.mul(student2, fill_value=0)
re_div = student1.div(student2, fill_value=0)
result = pd.DataFrame([re_add,re_sub,re_mul,re_div], index=['덧셈','뺄셈','곱셈','나눗셈'])
result

     국어      수학      영어
덧셈  NaN   160.0   180.0
뺄셈  NaN     0.0     0.0
곱셈  NaN  6400.0  8100.0
나눗셈 NaN     1.0     1.0

In [106]:
#데이터 프레임에 산술연산
import seaborn as sns

In [115]:
titanic = sns.load_dataset('titanic') #시본에서 타이타닉 데이터셋을 제공한다.
print(titanic.columns)
df = titanic[['age','fare']]
print(df.head(5))
addition = df + 10 #스칼라 연산 지원
print(addition.head())
print(type(addition))
subtraction = addition - df
print(subtraction.head())
print(subtraction.tail())
print(type(subtraction))

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')
    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500
<class 'pandas.core.frame.DataFrame'>
    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0
3  10.0  10.0
4  10.0  10.0
      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0
<class 'pandas.core.frame.DataFrame'>

In [118]:
print(titanic[titanic['age'] > 10])

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[650 rows x 15 columns]